In [4]:
import numpy as np
import pandas as pd
stuff={'corporation':['apple','google','meta','apple','google','meta'],
       'names':['john','jacob','julie','ron','aaron','may'],
       'salary':[110,200,220,300,400,450]}
my_df=pd.DataFrame(stuff)

In [11]:
my_df

  corporation  names  salary
0       apple   john     110
1      google  jacob     200
2        meta  julie     220
3       apple    ron     300
4      google  aaron     400
5        meta    may     450

In [12]:
company=my_df.groupby('corporation')
company

In [8]:
company.sum()

                  names  salary
corporation
apple           johnron     410
google       jacobaaron     600
meta           juliemay     670

In [17]:
company.min()

             names  salary
corporation
apple         john     110
google       aaron     200
meta         julie     220

In [14]:
company.count()

             names  salary
corporation
apple            2       2
google           2       2
meta             2       2

In [18]:
company.max()

             names  salary
corporation
apple          ron     300
google       jacob     400
meta           may     450

In [19]:
company.describe(
)

            salary
             count   mean         std    min    25%    50%    75%    max
corporation
apple          2.0  205.0  134.350288  110.0  157.5  205.0  252.5  300.0
google         2.0  300.0  141.421356  200.0  250.0  300.0  350.0  400.0
meta           2.0  335.0  162.634560  220.0  277.5  335.0  392.5  450.0